#+TITLE: Chapter 1 Exercises
#+PROPERTY: header-args :results output

** Solution
#+begin_src scheme
(define (weird-sum-of-squares a b c)
  (define x (if (> a b) a b))
  (define y (cond
             ((or (> c a) (> c b)) c)
             ((< a  b) a)
             (else b)))
  (+ (* x x) (* y y)))

(test-begin "1.3 sum-of-squares")
(test-assert
    (=
     25
     (weird-sum-of-squares 2 3 4)
     (weird-sum-of-squares 2 4 3)
     (weird-sum-of-squares 3 2 4)
     (weird-sum-of-squares 3 4 2)
     (weird-sum-of-squares 4 2 3)
     (weird-sum-of-squares 4 3 2)))
(test-end)
#+end_src

#+RESULTS:
:  Ok: 1 tests passed.

** Solution
#+begin_src scheme
(define (good-enough? last-guess guess)
  (< (abs (- 1 (/ last-guess guess))) 0.001))

(define (improve guess x)
  (/ (+ guess (/ x guess)) 2))

(define (sqrt-iter x last-guess guess)
  (if (good-enough? last-guess guess)
      guess
      (sqrt-iter x guess (improve guess x))))

(define (sqrt x)
  (sqrt-iter x 0.0 1.0))

(test-begin "1.7 - iterative sqrt")
(test-approximate 100000.0 (sqrt 10000000000.0) 0.001)
(test-end)
#+end_src

#+RESULTS:
:  Ok: 1 tests passed.

** Solution
#+begin_src scheme
(define (improve-cube-root-guess y x)
  (/ (+ (/ x (* y y)) (* 2 y)) 3))

(define (cube-root-iter x last-guess guess)
  (if (good-enough? last-guess guess)
      guess
      (cube-root-iter x guess (improve-cube-root-guess guess x))))

(define (cube-root x)
  (cube-root-iter x 0.0 1.0))

(test-begin "1.8 - iterative cube root")
(test-approximate 3 (cube-root 27) 0.001)
(test-end)
#+end_src

#+RESULTS:
:  Ok: 1 tests passed.

** Solution
#+name: recursive
#+begin_src scheme
(define (f n)
  (if (< n 3)
      n
      (+
       (f (- n 1))
       (* 2 (f (- n 2)))
       (* 3 (f (- n 3))))))

(test-begin "1.11 - recursive")
(test-equal 0 (f 0))
(test-equal 1 (f 1))
(test-equal 2 (f 2))
(test-equal 4 (f 3))
(test-equal 11 (f 4))
(test-equal 25 (f 5))
(test-end)
#+end_src

#+RESULTS: recursive
:  Ok: 6 tests passed.

#+name: iterative
#+begin_src scheme
(define (f n)
  (define (f-step n-1 n-2 n-3)
    (+ n-1 (* 2 n-2) (* 3 n-3)))
  (define (f-iter n-1 n-2 n-3 count)
    (if (= count 0)
        n-1
        (f-iter (f-step n-1 n-2 n-3) n-1 n-2 (- count 1))))
  (if (< n 3)
      n
      (f-iter 2 1 0 (- n 2))))

(test-begin "1.11 - iterative")
(test-equal 0 (f 0))
(test-equal 1 (f 1))
(test-equal 2 (f 2))
(test-equal 4 (f 3))
(test-equal 11 (f 4))
(test-equal 25 (f 5))
(test-end)
#+end_src

#+RESULTS: iterative
:  Ok: 6 tests passed.

** Solution
#+begin_src scheme
(define (pascal-triangle r k)
  (if (or (= r 1) (< k 2) (>= k r))
       1
       (+
        (pascal-triangle (- r 1) (- k 1))
        (pascal-triangle (- r 1) k))))

(test-begin "1.12 - pascal triangle")
(test-equal 6 (pascal-triangle 5 3))
(test-end)
#+end_src

#+RESULTS:
:  Ok: 1 tests passed.

** Solution
#+begin_src scheme
(define (expt b n)
  (define (even? n) (= 0 (remainder n 2)))
  (define (expt-iter b n a)
    (cond ((= n 0) a)
          ((even? n) (expt-iter (* b b) (/ n 2) a))
          (else  (expt-iter b (- n 1) (* a b)))))
  (expt-iter b n 1))

(test-begin "1.16 - Iterative exponentiation in O(log2 n) time")
(test-equal 1 (expt 10 0))
(test-equal 7 (expt 7 1))
(test-equal 9 (expt 3 2))
(test-equal 125 (expt 5 3))
(test-equal 625 (expt 5 4))
(test-equal 32 (expt 2 5))
(test-equal 729 (expt 3 6))
(test-equal 78125 (expt 5 7))
(test-equal 256 (expt 2 8))
(test-equal 19683 (expt 3 9))
(test-end)
#+end_src

#+RESULTS:
:  Ok: 10 tests passed.

** Solution
#+begin_src scheme
(define (even? n) (= 0 (remainder n 2)))
(define (halve n) (/ n 2))
(define (multi a b)
    (cond ((= b 0) 0)
          ((even? b) (multi (+ a a) (halve b)))
          (else  (+ a (multi a (- b 1) )))))

(test-begin "1.17 - Recursive multiplication in O(log2 n) time")
(test-equal 0 (multi 10 0))
(test-equal 7 (multi 7 1))
(test-equal 6 (multi 3 2))
(test-equal 15 (multi 5 3))
(test-equal 20 (multi 5 4))
(test-equal 10 (multi 2 5))
(test-equal 18 (multi 3 6))
(test-equal 35 (multi 5 7))
(test-equal 16 (multi 2 8))
(test-equal 27 (multi 3 9))
(test-end)
#+end_src


#+RESULTS:
:  Ok: 10 tests passed.

** Solution
#+begin_src scheme
(define (multi a b)
  (define (even? n) (= 0 (remainder n 2)))
  (define (halve n) (/ n 2))
  (define (multi-iter a b c)
    (cond ((= b 0) c)
          ((even? b) (multi-iter (+ a a) (halve b) c))
          (else  (multi-iter a (- b 1) (+ c a)))))
  (multi-iter a b 0))

(test-begin "1.18 - Iterative multiplication in O(log2 n) time")
(test-equal 0 (multi 10 0))
(test-equal 7 (multi 7 1))
(test-equal 6 (multi 3 2))
(test-equal 15 (multi 5 3))
(test-equal 20 (multi 5 4))
(test-equal 10 (multi 2 5))
(test-equal 18 (multi 3 6))
(test-equal 35 (multi 5 7))
(test-equal 16 (multi 2 8))
(test-equal 27 (multi 3 9))
(test-end)
#+end_src

#+RESULTS:
:  Ok: 10 tests passed.

** Solution
#+begin_src scheme
(define (fib n)
  (fib-iter 1 0 0 1 n))

(define (fib-iter a b p q count)
  (cond ((= count 0) b)
        ((even? count)
         (let ((p-squared (* p p))
               (q-squared (* q q)))
           (fib-iter a
                   b
                   (+ p-squared q-squared)
                   (+ q-squared (* 2 p q))
                   (/ count 2))))
        (else
         (let ((aq (* a q)))
           (fib-iter (+ (* b q)
                        aq
                        (* a p))
                     (+ (* b p)
                        aq)
                     p
                     q
                     (- count 1))))))

(test-begin "1.18 - Iterative Fibonacci calculation in O(log2 n) time")
(test-equal 1  (fib 1))
(test-equal 1  (fib 2))
(test-equal 2  (fib 3))
(test-equal 3  (fib 4))
(test-equal 5  (fib 5))
(test-equal 8  (fib 6))
(test-equal 13 (fib 7))
(test-equal 610 (fib 15))
(test-equal 1548008755920 (fib 60))
(test-equal 2880067194370816120 (fib 90))
(test-end)
#+end_src

#+RESULTS:
:  Ok: 10 tests passed.

** Solution
#+begin_src scheme
(load-from-path "1_22-definitions.scm")
(define (search-for-primes start)
  (define (search-for-primes-iter n count)
    (if (> count 0)
        (search-for-primes-iter
         (+ n 2)
         (if (timed-prime-test n) (- count 1) count))))
  (search-for-primes-iter
   (if (even? start) (+ start 1) start)
   3))
#+end_src

> (search-for-primes 100000)
100003 | 71004
100019 | 69836
100043 | 69686

> (search-for-primes 1000000)
1000003 | 413345
1000033 | 417740
1000037 | 417630

> (search-for-primes 10000000)
10000019 | 692164
10000079 | 673696
10000103 | 697857

> (search-for-primes 100000000)
100000007 | 1731865
100000037 | 1448142
100000039 | 1630682

Let m be the mean time for the three smallest primes greater than 100000 and T_n to be the measured time (in nanoseconds) to check for primality of n. If m is taken take as the standard computation time for prime test, the deviation, D_n, from the expected computation time is:

D_n = T_n - m*(sqrt(n)/sqrt(100000))

Observed mean:
m = 70175

|         n | T_n (ns) |           D_n |
|-----------+----------+---------------|
|   1000003 |   413345 |     191431.83 |
|   1000033 |   417740 |     195823.50 |
|   1000037 |   417630 |     195713.06 |
|  10000019 |   692164 |    -9586.6667 |
|  10000079 |   673696 |    -28056.772 |
|  10000103 |   697857 |    -3896.6140 |
| 100000007 |  1731865 |    -487263.43 |
| 100000037 |  1448142 |    -770986.76 |
| 100000039 |  1630682 |    -588446.78 |
|-----------+----------+---------------|
|  Variance |       -- | 137875470000. |
#+tblfm: $3=$2-70175*(sqrt($1)/sqrt(100000))::@11$3=vvar(@I..@II)

